Autodesk.Revit.DB.Structure.RebarShape.HasEndTreatment
returns true if the shape has end treatment for at least one end.
Since:
2017

Autodesk.Revit.DB.Structure.RebarShape.SetEndTreatmentTypeId(Autodesk.Revit.DB.ElementId,System.Int32)
set the end treatment type id for the designated shape end
Throws Autodesk.Revit.Exceptions.ArgumentException:
iEnd not a valid shape end
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2017

Autodesk.Revit.DB.Structure.RebarShape.GetEndTreatmentTypeId(System.Int32)
get the id of the end treatment for the designated shape end
Throws Autodesk.Revit.Exceptions.ArgumentException:
iEnd not a valid shape end
Since:
2017

Autodesk.Revit.DB.Structure.RebarShape.IsSameShapeIgnoringHooks(Autodesk.Revit.DB.Structure.RebarShape)
Test whether two shapes have equivalent definitions by comparing
the RebarShapeDefinition and MultiplanarDefinition properties.
Remarks:
This method will return true if the definitions are exactly
equivalent, or if they are equivalent but have the opposite
start/end orientation.
Replaces the property RebarShape.SameShapeIgnoringHooks from prior releases.
otherShape:
Another shape to be compared to this one.
Returns:
True if the shape definitions match, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShape.GetCurvesForBrowser
Generate curves for the shape, as used in the shape browser.
Returns:
An array of curves representing the shape with its default parameters.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetDefaultHookOrientation(System.Int32)
Get the hook orientation.
Remarks:
Replaces the method GetHookOrientation() from prior releases.
index:
0 for the starting hook, 1 for the ending hook.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index must be 0 or 1.
Since:
2014

Autodesk.Revit.DB.Structure.RebarShape.GetDefaultHookAngle(System.Int32)
Get the hook angle, expressed as an integral number of degrees (common values are 0, 90, 135, and 180).
Remarks:
Replaces the method GetHookAngle() from prior releases.
index:
0 for the starting hook, 1 for the ending hook.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index must be 0 or 1.
Since:
2014

Autodesk.Revit.DB.Structure.RebarShape.GetAllowed(Autodesk.Revit.DB.Structure.RebarBarType)
Check whether a bar type can be used with this RebarShape. Bar types are allowed by default.
barType:
A bar type in the same document as this shape.
Returns:
True if this shape may be combined with this barType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.SetAllowed(Autodesk.Revit.DB.Structure.RebarBarType,System.Boolean)
Specify which bar types can be used with this RebarShape. Bar types are allowed by default.
barType:
A bar type in the same document as this shape.
allowed:
Whether this shape may be combined with barType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetMultiplanarDefinition
The optional 3D structure of the shape.
Returns:
A copy of the multiplanar definition. Changes will not affect the RebarShape.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShape.GetRebarShapeDefinition
Return the definition of the RebarShape.
Remarks:
Replaces the property RebarShape.Definition from previous releases.
Returns:
A copy of the definition. Changes will not affect the RebarShape.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShape.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShapeDefinition,Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.StirrupTieAttachmentType,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32)
Create a new instance of a Rebar Shape, which defines the shape of a rebar.
Remarks:
Replaces the method Autodesk.Revit.Creation.NewRebarShape() from prior releases.
doc:
A document to contain the RebarShape.
definition:
The definition of the rebar shape, as a set of curves in a plane
driven by parameters.
multiplanarDefinition:
If not null, the created RebarShape will be a 3D shape. The shape
is built out of the planar RebarShapeDefinition, with additional
out-of-plane segments defined by the RebarShapeMultiplanarDefinition
object. Not supported in conjunction with RebarShapeDefinitionByArc
of type Spiral or LappedCircle.
style:
Whether the shape is to be used as a standard bar or a stirrup/tie.
attachmentType:
When the style is stirrup/tie, specify whether it will attach to the
interior of cover (cover is measured to the stirrups), or to the
exterior of cover (cover is measured to the standard bars).
Ignored when the style is Standard.
startHookAngle:
The start hook angle, expressed as an integral number of degrees.
If 0, the shape will have no start hook. Common values are 0, 90, 135, and 180.
startHookOrientation:
The orientation of the start hook.
Ignored when startHookAngle is 0.
endHookAngle:
The end hook angle, expressed as an integral number of degrees.
If 0, the shape will have no end hook. Common values are 0, 90, 135, and 180.
endHookOrientation:
The orientation of the end hook.
Ignored when endHookAngle is 0.
higherEnd:
When the rebar crosses itself, one end will be "lifted" to avoid self-intersection.
Specify which end should be lifted: 0 for start, 1 for end.
Returns:
A new RebarShape instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
definition is linked to a Document other than doc.
-or-
A multiplanar definition is specified when the given RebarShapeDefinition
does not support it. The following RebarShapeDefinitions do not support
multiplanar: a simple line; spiral; lapped circle.
-or-
The DepthParamId property of multiplanarDefinition
is invalid or has not been added to definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
startHookAngle must be at least 0 and no more than 180.
-or-
endHookAngle must be at least 0 and no more than 180.
-or-
higherEnd must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShape.ShapeFamilyId
Get and return the rebar shape family id.
Since:
2015

Autodesk.Revit.DB.Structure.RebarShape.HigherEnd
Defines the higher end of rebar shape.
Remarks:
Change this property will make rebar shape's start and end hooks swap.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.StirrupTieAttachment
The attachment type of stirrup ties and rebars.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.RebarStyle
Whether the shape represents a standard bar or a stirrup.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.SimpleArc
Check whether this shape consists of a single arc, possibly with hooks.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.SimpleLine
Check whether this shape consists of a single straight segment, possibly with hooks.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape
RebarShape specifies the shape type for a Rebar instance.
Since:
2009